# Exercises in pandas

In [2]:
import numpy as np
import pandas as pd

### Exercise 1

Create a pandas series object from elements [4, 7, -5, 3]. Call it data

In [4]:
data = pd.Series([4,7,5,-3])
data

0    4
1    7
2    5
3   -3
dtype: int64

### Exercise 2

Create a pandas series object from elements [4, 7, -5, 3] and index ['d', 'b', 'a', 'c']. Call it data2

In [6]:
data = pd.Series([4,7,5,-3], index=['d', 'b', 'a', 'c'])
data

d    4
b    7
a    5
c   -3
dtype: int64

### Exercise 3


Create a pandas series object from sdata using cities as index

In [7]:
sdata = {'Mumbai': 35000, 'Hyderabad': 71000, 'Kanpur': 16000, 'Ahmedabad': 5000}
cities = ['Hyderabad', 'Mumbai', 'Ahmedabad', 'Kanpur','Pune']
### Your code here ###
data = pd.DataFrame(sdata, index=cities)
data

           Mumbai  Hyderabad  Kanpur  Ahmedabad
Hyderabad   35000      71000   16000       5000
Mumbai      35000      71000   16000       5000
Ahmedabad   35000      71000   16000       5000
Kanpur      35000      71000   16000       5000
Pune        35000      71000   16000       5000

### Exercise 4

use pd.isnull to find if any of the elements of the series is null

In [9]:
### Your code here ###
data.isnull()

           Mumbai  Hyderabad  Kanpur  Ahmedabad
Hyderabad   False      False   False      False
Mumbai      False      False   False      False
Ahmedabad   False      False   False      False
Kanpur      False      False   False      False
Pune        False      False   False      False

### Exercise 5


Create a dataframe df from data. <br>
(a) Print the first 2 rows. <br>
(b) Print the column 'state' <br>
(c) Use index =['one', 'two', 'three', 'four','five', 'six'] <br>
(d) Print row with index 'three'

In [10]:
data = {'state': ['AP', 'Maharashtra', 'Himanchal', 'Punjab', 'UP', 'Punjab'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]} 
        
### Your code here ###
df = pd.DataFrame(data)
print(df.head(2))
print(df['state'])
df.index = ['one', 'two', 'three', 'four','five', 'six']
df.loc['three']

         state  year  pop
0           AP  2000  1.5
1  Maharashtra  2001  1.7
0             AP
1    Maharashtra
2      Himanchal
3         Punjab
4             UP
5         Punjab
Name: state, dtype: object

state    Himanchal
year          2002
pop            3.6
Name: three, dtype: object

### Exercise 6
                   
(a) Print all rows of data where data['one'] < 5 <br>
(b) create a dataframe data2 with columns 'two' and 'three' of data<br>
(c) Print columns 'two' and 'four' of index 'Gurjat'<br>
(d) Print row 2<br>
(e) Print columns 'two' and 'four' of index upto 'Kerala'<br>

In [11]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Punjab', 'Gujrat', 'Kerala', 'UP'], 
                    columns=['one', 'two', 'three', 'four']) 
### YOur code here
print(data[data['one'] < 5])
data2 = data[['two', 'three']]
print(data.loc['Gujrat', ['two', 'three']])
print(data.iloc(1))
print(data.loc[:'Kerala', ['two', 'four']])

        one  two  three  four
Punjab    0    1      2     3
Gujrat    4    5      6     7
two      5
three    6
Name: Gujrat, dtype: int64
<pandas.core.indexing._iLocIndexer object at 0x7f0c7089dc28>
        two  four
Punjab    1     3
Gujrat    5     7
Kerala    9    11

### Exercise 7

(a) Apply x.min() to each row of df1 using 'apply' <br>
(b) Add 2 to each element of col 'c' in df1 using 'map' <br>
(c) Using applymap add 1000 to each element of the dataframe df1 <br>

In [16]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['MP', 'Tamilnadu', 'Rajasthan'])
### Your code here
print(df1)
df1.apply(lambda x: x.min())
df1['c'] = df1.c.map(lambda x: x+2)
df1 = df1.applymap(lambda x: x+ 1000)
print(df1)

             b    c    d
MP         0.0  1.0  2.0
Tamilnadu  3.0  4.0  5.0
Rajasthan  6.0  7.0  8.0
                b       c       d
MP         1000.0  1003.0  1002.0
Tamilnadu  1003.0  1006.0  1005.0
Rajasthan  1006.0  1009.0  1008.0

### Exercise 8

(a) Sort index of df2 lexicographically <br>
(b) Reset and drop index of df2  <br>
(c) Print the number of unique values in each col of df2 <br>
(d) Print the number of occurences of each value of each column of df2 <br>

In [17]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Goa', 'MP', 'Tamilnadu', 'Rajasthan'])
### Your code here
print(df2.sort_index())
df2.reset_index(drop=True)
for col in list(df2.columns):
    print(df2[col].nunique())
for col in list(df2.columns):
    print(df2[col].value_counts())

             b     d     e
Goa        0.0   1.0   2.0
MP         3.0   4.0   5.0
Rajasthan  9.0  10.0  11.0
Tamilnadu  6.0   7.0   8.0
4
4
4
9.0    1
6.0    1
3.0    1
0.0    1
Name: b, dtype: int64
10.0    1
7.0     1
4.0     1
1.0     1
Name: d, dtype: int64
11.0    1
8.0     1
5.0     1
2.0     1
Name: e, dtype: int64

### Exercise 9

(a) Print correlation between microsoft and IBM using returns dataframe <br>
(a) Print covariance between microsoft and IBM using returns dataframe<br>

In [20]:
import pandas_datareader.data as web 
all_data = {ticker: web.get_data_yahoo(ticker) 
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']} 

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})
returns = price.pct_change()

### Your code here
returns['MSFT'].corr(returns['IBM'])
returns['MSFT'].cov(returns['IBM'])

8.734553290360266e-05

### Exercise 10

(a) Using read_csv load the file '../datasets/ex1.csv' into a dataframe data <br>
(b) Print all elements of data <br>

In [22]:
### Your code here
data = pd.read_csv('../datasets/ex1.csv')
data

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### Exercise 11

Using pd.read_csv read '../datasets/ex6.csv' in chunks of 1000

In [27]:
### Your code here
chunk = pd.read_csv('../datasets/ex6.csv', chunksize=1000)

### Exercise 12 

Using pd.read_csv read '../datasets/ex7.csv' with header=None

In [23]:
### your code here
data = pd.read_csv('../datasets/ex7.csv', header=None)
data

   0  1  2
0  a  b  c
1  1  2  3
2  1  2  3